---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungMod1
source: html/21bc2383-cdcd-3a41-d741-f37dc243edc8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungMod1 Property

"Young modulus X"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamYoungMod1 { get; }
```